[
  {
    "title": "National University of Singapore",
    "content": "I was one of just two informatics students selected for a year-long exchange at the National University of Singapore, ranked 4th in the world for Computer Science. During my time there, I explored a wide range of modules including Fundamentals of Quantitative Finance, Optimisation Algorithms, Data Modelling and Computation, and Programming Methodology. Outside academics, I played basketball and was proud to be made captain at CAPT, which gave me the chance to lead and represent the community through sport.",
    "date": "July 2025 – May 2026"
  },
  {
    "title": "The University of Edinburgh",
    "content": "Currently pursuing my Bachelor’s in Computer Science, where I’ve been able to balance academics with a wide range of extracurriculars. I play for the official university Women’s Basketball W3 team, competing in BUCS, the Scottish National League, and Scottish Student Sports tournaments. I’m also an active member of the Edinburgh University Debates Union, one of the oldest societies here, and was invited to judge at Edinburgh Juniors. Within the School of Informatics, I serve on the executive committee of Hoppers (our gender diversity in tech society), helping to organise hackathons and inclusivity events. I also enjoy being part of CompSoc to sharpen my technical skills, and spend time at the Chess Club, testing myself against players of all levels.",
    "date": "September 2023 – May 2025"
  },
  {
    "title": "Sri Kumaran Children Home (Kumarans)",
    "content": "Finished high school with a focus on Physics, Chemistry, Math, and Computer Science. Beyond the classroom, I was deeply involved in sports and leadership: I ran track, played on the basketball team, and was an active debater. I also served as class representative, which taught me early lessons in teamwork and responsibility, while continuing to grow my technical interests through subjects like SQL and QBasic.",
    "date": "2021 – 2023"
  },
  {
    "title": "The Brigade Schools – Bengaluru",
    "content": "My schooling years laid the foundation for both academics and extracurriculars. I was recognised as the Mathematics Topper, wrote regularly for the school magazine, and proudly swam as part of the school team, earning medals at competitions. Alongside this, I stayed active in basketball and track, building a balance between academics, creativity, and sport.",
    "date": "June 2009 – June 2015"
  }
]
