[
    {
      "title": "Basketball",
      "content": "Basketball has been part of my life for over ten years — it started in school, where I trained and competed seriously, and has stayed with me as my go-to detox and stress reliever. At school, I played competitively on the team for five years, captained our U-14 side to a silver medal at the R.A. Devi Memorial Cup, and helped secure a 3rd place finish at the South Bangalore state clusters. I also represented MNKR and JSC clubs at the championship level, collecting medals and lifelong memories.\n\nBut beyond the wins and tournaments, basketball gave me something more valuable: meaningful friendships and a community that always felt like family. At Edinburgh, I’ve carried this passion forward as a member of the Women’s 3s — the official university basketball team, competing in the Scottish National League, BUCS, and Scottish Student Sports tournaments. No matter how stressful the week gets, time on the court clears my mind. Basketball has taught me resilience, teamwork, and the importance of showing up for the people around you — lessons I take with me far beyond the game."
    },
    {
      "title": "Debate",
      "content": "Debate opened my mind to a world of possibilities. What started as school-level tournaments quickly grew into a passion for parliamentary debates, logical reasoning, and persuasive communication. I fell in love with the energy of debates — the thrill of thinking on your feet, the satisfaction of connecting ideas, and the joy of learning from every round.\n\nOver time, I competed at some of the country’s most competitive stages — ranking among the top 36 speakers in India at the ISDS National Camp, winning the Sahodaya Parliamentary Debate (also receiving the 2nd best speaker award), and reaching semifinals and octofinals at national and international tournaments like Kumarans PD and Aditi PD.\n\nAt Edinburgh, I found my debating community again in the University Debates Union, the second-oldest society of its kind in the UK. It has a long tradition of fostering social and political dialogue, and being part of it has been both humbling and inspiring. Recently, I was invited to judge Edinburgh Juniors, mentoring younger debaters and watching them discover the same spark that hooked me years ago."
    },
    {
      "title": "Chess",
      "content": "If basketball and debate are bursts of adrenaline, chess is my calm constant. It’s one of my most consistent hobbies — I’ve played since school, often casually with friends or even strangers, and it’s always been about strategy, patience, and quiet focus. These days, I not only enjoy playing but also watching and studying chess games, inspired by players like Anish Giri and Divya Deshmukh, whose creativity and precision I deeply admire.\n\nAt Edinburgh, I play regularly at the University Chess Club, where the rating range is vast — from casual players around 800 to experts above 2000. Every game teaches me something new, whether it’s the art of planning ahead, recovering after a mistake, or simply appreciating the elegance of the game. Chess, for me, is both grounding and endlessly fascinating."
    },
    {
      "title": "Leadership & Social Impact",
      "content": "Hoppers (University of Edinburgh, 2023–24): As Head of Media on the executive committee of Edinburgh Hoppers, the gender diversity society in informatics, I led campaigns that boosted our online engagement by 78%. I also helped coordinate events like Ada Hack 2024, one of Edinburgh’s largest hackathons, along with industry talks and community-building workshops. It was a chance to blend creativity with impact — using data-driven media strategies to champion inclusivity in STEM.\n\nGirl Up Unnathi (Vice President, 2021–22): Back in Bangalore, I co-founded and served as Vice President of Girl Up Unnathi, a chapter of the global Girl Up initiative. Our team organized donation drives, webinars on mental health and empowerment, and collaborated as part of the Karnataka Girl Up Coalition. We even created a website, Instagram page, and podcast to spread awareness. It was incredible to see our chapter grow into a space where young voices could come together to talk about issues that mattered.\n\nParikrama Foundation (Tutor, 2021): I worked as an English tutor for the Parikrama Foundation, teaching a batch of 20 underprivileged students. From designing a curriculum to working through language barriers, it was a humbling experience in patience, empathy, and the power of education.\n\nYLAC Counter Speech Fellowship (2021): As a fellow, I ran social media campaigns around mental health, gender equality, and diversity. Collaborating with influencers and even working with Shashi Tharoor to amplify advocacy work gave me a taste of how impactful digital campaigns can be.\n\nFAITH Initiative (Founder, 2020): During the pandemic, I started the FAITH Initiative (Food Assistance Initiative for Teen Helpers). We mobilized 40+ students to cook meals daily for migrant workers and distributed them through ATRIA Foundation. Something that started as a small idea grew into a movement of compassion, reminding me how powerful youth-led initiatives can be."
    },
    {
      "title": "Cooking",
      "content": "Cooking is where my creativity and curiosity meet. You’ll often find me in the kitchen, experimenting with new recipes, testing healthier twists, or baking just for the joy of it. Some of my favorite creations include oat cakes for breakfast, traditional Mangalorean ghee roast, and fresh homemade pesto. Cooking also ties me to home and heritage while giving me a way to share with friends — food, after all, is one of the best ways to connect."
    },
    {
      "title": "Travelling",
      "content": "Travel has shaped some of my most foundational experiences at university. From an impromptu 4 a.m. trip to Fort William, to a cozy winter weekend in Ballater, to exam getaways at Kinloch — every trip has brought adventure, laughter, and lessons. I’ve road-tripped around Loch Ness and Inverness, explored the Isle of Skye and Loch Lomond, hiked through Glencoe, and even wandered through historic English towns like Cambridge, Windsor, and London.\n\nFor me, travel is about more than sightseeing — it’s about the small moments: sipping tea after a long hike, watching the weather shift on a Scottish loch, or strolling across a university lawn in the sun. These experiences have shaped my adaptability, curiosity, and love for the unexpected."
    },
    {
      "title": "Hiking",
      "content": "Hiking has become one of my favorite weekend activities at university. I’ve trekked Ben Duhn, Loch Muick, Loch Lomond, and Conic Hill, alongside countless climbs up Arthur’s Seat. Scotland’s moody weather makes every hike an adventure — sometimes you’re battling wind and rain, other times you’re rewarded with stunning, golden views. Hiking has taught me endurance, resilience, and the joy of pushing myself physically while recharging mentally."
    },
    {
      "title": "Achievements & Awards",
      "content": "The Edinburgh Award (2024) — recognized for my contribution to the university’s web migration project (EdWeb 2 CMS).\nJane Street Estimathon Winner (2024) — 1st place at Edinburgh University’s competition.\nISDS National Camp — ranked among the top 36 speakers in India.\nMultiple school awards across debate, athletics, swimming, and leadership."
    },
    {
      "title": "Writing & Creative Work",
      "content": "Writing has been with me since childhood — my first poem was published when I was six, and since then, I’ve fallen in love with weaving stories, essays, and articles. I’ve won creative writing competitions, published in newspapers, and maintained a personal blog.\n\nOne of the most exciting milestones was being selected (out of 250+ applicants) to intern at Sleep Deprived Dreamers, where I published 10+ articles on college admissions and student life. Later, I was offered the role of Head of Content Writing, managing LinkedIn outreach. Writing for me is a mix of reflection and connection — a way to make sense of the world while sharing stories that resonate with others."
    },
    {
      "title": "Crafts & Creativity",
      "content": "Crafts are my favorite way of bringing imagination to life. I love making personalized, handmade gifts — from 3D cake pop-ups to explosion boxes, foldable cards, and delicate ballerina cutouts. Each project feels like building a little world out of paper, colors, and creativity. For me, crafting is about joy — the joy of creating something unique and the joy of giving it to someone who’ll treasure it."
    }
  
]
